package com.udemy.zaur_tregulov.course_1.homework.lesson_1;

/**
 * @author Siarhei Korbut
 * Вывести в консоль рубаи (четверостишье), соблюдая все отступы в следующем виде:
 *
 *                   РУБАИ
 * Много лет размышлял я над жизнью земной."
 * Непонятного нет для меня под луной."
 * Мне известно, что мне ничего не известно!"
 * Вот последняя правда, открытая мной.
 *                                  О. Хайям
 */

public class Task_1 {
    public static void main(String[] args) {

        //Вывод текста в консоль с соблюдением необходимых отступов.
        System.out.println("                  РУБАИ");
        System.out.println("Много лет размышлял я над жизнью земной.");
        System.out.println("Непонятного нет для меня под луной.");
        System.out.println("Мне известно, что мне ничего не известно!");
        System.out.println("Вот последняя правда, открытая мной.");
        System.out.println("                                 О. Хайям");
    }
}
